app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 3], ["id", 19]]
---
  def edit
    if params[:artist_id]
      artist=Artist.find_by(id: params[:artist_id])
        if artist.nil?
          redirect_to artists_path, alert: "Artist Not Found"
        else
          @song=artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 18]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "idk"], ["artist_id", 5], ["updated_at", "2018-02-24 20:44:49.278604"], ["id", 18]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)